app/controllers/comments_controller.rb

SELECT  "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "response", "created_at", "updated_at", "shot_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dgdfgdf"], ["response", "dfgdfgdfg"], ["created_at", "2020-04-16 04:38:34.563466"], ["updated_at", "2020-04-16 04:38:34.563466"], ["shot_id", 1], ["user_id", 2]]
---
  def create
  	@shot = Shot.find(params[:shot_id]) # finds the shot with the associated shot_id
  	@comment = @shot.comments.create(comment_params) # creates the comment on the shot passing in params

SELECT  "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."shot_id" = ? AND "comments"."id" = ? LIMIT ?  [["shot_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
  	@shot = Shot.find(params[:shot_id])
  	@comment = @shot.comments.find(params[:id])
  	@comment.destroy